In [1]:
import pandas as pd
import numpy as np
data = pd.Series(np.random.randn(9),
                index = [['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [2]:
data

a  1   -2.229640
   2    1.067932
   3   -1.355508
b  1   -0.651822
   3   -1.236951
c  1    0.106682
   2   -0.691224
d  2    1.944254
   3    0.629287
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [4]:
data['b']

1   -0.651822
3   -1.236951
dtype: float64

In [5]:
data[['b','c']]

b  1   -0.651822
   3   -1.236951
c  1    0.106682
   2   -0.691224
dtype: float64

In [9]:
data.loc[:,2]

a    1.067932
c   -0.691224
d    1.944254
dtype: float64

In [13]:
data = data.unstack().fillna(0)

In [14]:
data.stack()

a  1   -2.229640
   2    1.067932
   3   -1.355508
b  1   -0.651822
   2    0.000000
   3   -1.236951
c  1    0.106682
   2   -0.691224
   3    0.000000
d  1    0.000000
   2    1.944254
   3    0.629287
dtype: float64

In [15]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     index = [['a','a','b','b'],[1,2,1,2]],
                     columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [16]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [17]:
frame.index.names = ['key1','key2']

In [18]:
frame.columns.names = ['state','color']

In [19]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [20]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [26]:
frame.swaplevel(0,1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [27]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [30]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [32]:
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [36]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [37]:
frame = pd.DataFrame({'a':range(7),
                      'b':range(7,0,-1),
                      'c':['one','one','one','two','two','two','two'],
                      'd':[0,1,2,0,1,2,3]})

In [38]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [39]:
frame2 = frame.set_index(['c','d'])

In [40]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [41]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [42]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [60]:
df2 = pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [61]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [62]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [63]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [64]:
pd.merge(df1,df2,on = 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [65]:
df3 = pd.DataFrame({'1key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [66]:
df4 = pd.DataFrame({'rkey':['a','b','d'],'data2':np.random.randn(3)})

In [67]:
df4

  rkey     data2
0    a  0.906973
1    b -0.587521
2    d -0.743420

In [68]:
pd.merge(df3,df4,left_on = '1key',right_on = 'rkey')

  1key  data1 rkey     data2
0    b      0    b -0.587521
1    b      1    b -0.587521
2    b      6    b -0.587521
3    a      2    a  0.906973
4    a      4    a  0.906973
5    a      5    a  0.906973

In [70]:
pd.merge(df1,df2,how = 'outer').fillna(3.14)

  key  data1  data2
0   b   0.00   1.00
1   b   1.00   1.00
2   b   6.00   1.00
3   a   2.00   0.00
4   a   4.00   0.00
5   a   5.00   0.00
6   c   3.00   3.14
7   d   3.14   2.00

In [71]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [72]:
df2 = pd.DataFrame({'key':['a','b','a','b','d'],'data2':range(5)})

In [73]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [74]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [75]:
pd.merge(df1,df2,on = 'key',how = 'left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [76]:
left = pd.DataFrame({'key1':['foo','foo','bar'],'key2':['one','two','one'],'lval':[1,2,3]})

In [77]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [78]:
right = pd.DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})

In [79]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [82]:
pd.merge(left,right,on = ['key1','key2'],how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [83]:
pd.merge(left,right,on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [84]:
pd.merge(left,right,on = 'key1',suffixes = ('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [86]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})

In [89]:
right1 = pd.DataFrame({'group_val':[3.5,7]},index = ['a','b'])

In [90]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [91]:
right1

   group_val
a        3.5
b        7.0

In [93]:
pd.merge(left1,right1,left_on = 'key',right_index = True,how = 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [95]:
lefth = pd.DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],
                      'key2':[2000,2001,2002,2001,2002],
                      'data':np.arange(5.)})

In [96]:
righth = pd.DataFrame(np.arange(12).reshape((6,2)),
                     index = [['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                             [2001,2000,2000,2000,2001,2002]],
                     columns = ['event1','event2'])

In [97]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [98]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [100]:
pd.merge(lefth,righth,left_on = ['key1','key2'],right_index = True,how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [101]:
left2 = pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]],
                    index = ['a','c','e'],
                    columns = ['Ohio','Nevada'])

In [102]:
right2 = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13,14]],
                     index = ['b','c','d','e'],
                     columns = ['Missouri','Alabama'])

In [103]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [104]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [105]:
pd.merge(left2,right2,how = 'outer',left_index = True,right_index = True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [106]:
left2.join(right2,how = 'outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [108]:
left1.join(right1,on = 'key').fillna(3.14)

  key  value  group_val
0   a      0       3.50
1   b      1       7.00
2   a      2       3.50
3   a      3       3.50
4   b      4       7.00
5   c      5       3.14

In [109]:
another = pd.DataFrame([[7,8],[9,10],[11,12],[16,17]],
                      index = ['a','c','e','f'],
                      columns = ['New York','Oregon'])

In [113]:
left2.join([right2,another],how = 'inner')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
c   3.0     4.0       9.0     10.0         9      10
e   5.0     6.0      13.0     14.0        11      12

In [114]:
arr = np.arange(12).reshape((3,4))

In [115]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [118]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [119]:
s1 = pd.Series([0,1],index = ['a','b'])
s2 = pd.Series([2,3,4],index = ['c','d','e'])
s3 = pd.Series([5,6],index = ['f','g'])

In [121]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [122]:
s4 = pd.concat([s1,s3])

In [123]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [124]:
pd.concat([s1,s4],axis=1)

G:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [125]:
pd.concat([s1,s4],axis=1,join = 'inner')

   0  1
a  0  0
b  1  1

In [126]:
pd.concat([s1,s4],axis = 1,join_axes = [['a','c','b','e']])

G:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

In [129]:
result = pd.concat([s1,s1,s3,s4],keys = ['one','two','three','four'])

In [130]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
four   a    0
       b    1
       f    5
       g    6
dtype: int64

In [133]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0
four   0.0  1.0  5.0  6.0

In [135]:
pd.concat([s1,s2,s3],axis=1,keys = ['one','two','three'])

G:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [136]:
df1 = pd.DataFrame(np.arange(6).reshape((3,2)),
                  columns = ['one','two'],
                  )

In [137]:
df1

   one  two
0    0    1
1    2    3
2    4    5

In [138]:
df2 = pd.DataFrame(5+np.arange(4).reshape((2,2)),
                  columns = ['three','four'])

In [139]:
df2

   three  four
0      5     6
1      7     8

In [140]:
pd.concat([df1,df2],axis=1,keys = ['level1','level2'])

  level1     level2
     one two  three four
0      0   1    5.0  6.0
1      2   3    7.0  8.0
2      4   5    NaN  NaN

In [141]:
pd.concat({'level1':df1,'level2':df2},axis=1)

  level1     level2
     one two  three four
0      0   1    5.0  6.0
1      2   3    7.0  8.0
2      4   5    NaN  NaN

In [144]:
pd.concat([df1,df2],axis=1,keys = ['level1','level2'],names = ['upper','lowre'])

upper level1     level2
lowre    one two  three four
0          0   1    5.0  6.0
1          2   3    7.0  8.0
2          4   5    NaN  NaN

In [145]:
df1 = pd.DataFrame(np.random.randn(3,4),columns = ['a','b','c','d'])

In [150]:
df2 = pd.DataFrame(np.random.randn(2,4),columns = ['b','d','a','e'])

In [151]:
df1

          a         b         c         d
0 -1.354578 -0.013577 -1.161550  0.555276
1 -1.417431 -0.413718  2.507494  0.169058
2  0.646789  1.007975  1.729496  0.114149

In [152]:
df2

          b         d         a         e
0 -0.858202 -1.212461 -1.248398  0.054750
1 -1.074587 -0.059592  0.647972 -0.510972

In [158]:
pd.concat([df1,df2],ignore_index = True)

G:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b        c         d          e
0 -1.354578 -0.013577 -1.16155  0.555276
1 -1.417431 -0.413718  2.50749  0.169058
2  0.646789  1.007975   1.7295  0.114149
3 -1.248398 -0.858202       -1.212461  0.0547502
4  0.647972 -1.074587       -0.059592  -0.510972

In [161]:
a = pd.Series([np.nan,2.5,0.0,3.5,4.5,np.nan],
             index = ['f','e','d','c','b','a'])

In [162]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [163]:
b = pd.Series([0,np.nan,2,np.nan,np.nan,5],
             index = ['a','b','c','d','e','f'])

In [164]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [165]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [166]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

In [170]:
df1 = pd.DataFrame({'a':[1,np.nan,5,np.nan],
                   'b':[np.nan,2,np.nan,6],
                   'c':range(2,18,4)})

In [171]:
df2 = pd.DataFrame({'a':[5,4,np.nan,3,7],
                   'b':[np.nan,3,4,6,8]})

In [172]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [173]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [174]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN